<?php
	if (! defined('WORK')) die('HIERARСHY_ERROR');
	/**************************************************************************************************
	***************************Вспомогательные функции для вывода**************************************
	**************************************************************************************************/
	//Убираем индексные элементы из массива
	function exclude_indexes($arr){
		$res = $arr;
		foreach ($res as $key=>$value){
			if (intval($key) > 0){
				unset($res[$key]);
			}
		}
		unset($res[0]);
		return $res;
	}
?>